#!/usr/bin/env python3
# -*- coding: utf-8 -*-

#############################################内置函数############################################
#abs
print(abs(100))					#100
print(abs(-20))					#20
print(abs(12.34))				#12.34

#max
print(max(1, 2))				#2
print(max(2, 3, 1, -5))			#3

#############################################内置函数############################################




#############################################类型转换############################################
#Python内置的常用函数还包括数据类型转换函数
print(int('123'))				#123
print(int(12.34))				#12
print(float('12.34'))			#12.34
print(str(1.23))				#'1.23'
print(str(100))					#'100'
print(bool(1))					#True
print(bool(''))					#False


#函数名其实就是指向一个函数对象的引用，完全可以把函数名赋给一个变量，相当于给这个函数起了一个“别名”
 # a = abs
 # print(a(-1))					#1  		草报错

#############################################类型转换############################################
